app/controllers/articles_controller.rb

    def create
        @article = Article.new(article_params)
        if @article.save
---
INSERT INTO "articles" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["title", "aaaaaaaaa"], ["content", "bbbbbbbbbbbb"], ["created_at", "2025-09-05 14:49:34.857100"], ["updated_at", "2025-09-05 14:49:34.857100"]]

    def update
        if @article.update(article_params)
---
UPDATE "articles" SET "title" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "bbbbbbbbbb"], ["updated_at", "2025-09-05 14:49:55.951198"], ["id", 16]]

    def destroy
        article = Article.find(params[:id])
        article.destroy!
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 1]]